[
  {
    "id": "https://azure.microsoft.com/en-us/blog/?p=39302",
    "title": "Accelerating agentic workflows with Azure AI Foundry, NVIDIA NIM, and NVIDIA AgentIQ",
    "source": "Microsoft Azure Blog",
    "content": "<p class=\"wp-block-paragraph\">I&#8217;m excited to share a major leap forward in how we develop and deploy AI. In collaboration with NVIDIA, we&#8217;ve integrated NVIDIA NIM microservices and NVIDIA AgentIQ toolkit into <a href=\"https://azure.microsoft.com/en-us/products/ai-foundry\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Foundry</a>—unlocking unprecedented efficiency, performance, and cost optimization for your AI projects. </p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">Create with Azure AI Foundry &gt;</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"a-new-era-of-ai-efficiency\">A new era of AI efficiency </h2>\n\n\n\n<p class=\"wp-block-paragraph\">In today’s fast-paced digital landscape, scaling AI applications demands more than just innovation—it requires streamlined processes that deliver rapid time-to-market without compromising on performance. With enterprise AI projects often taking 9 to 12 months to move from conception to production, every efficiency gain counts. Our integration is designed to change that by simplifying every step of the AI development lifecycle.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"nvidia-nim-on-azure-ai-foundry\">NVIDIA NIM on Azure AI Foundry </h2>\n\n\n\n<p class=\"wp-block-paragraph\">NVIDIA NIM™, part of the NVIDIA AI Enterprise software suite, is a suite of easy-to-use microservices engineered for secure, reliable, and high-performance AI inferencing. Leveraging robust technologies such as NVIDIA Triton Inference Server™, TensorRT™, TensorRT-LLM, and PyTorch, NIM microservices are built to scale seamlessly on managed Azure compute. </p>\n\n\n\n<p class=\"wp-block-paragraph\">They provide:&nbsp;</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Zero-configuration deployment:</strong> Get up and running quickly with out-of-the-box optimization. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Seamless Azure integration:</strong> Works effortlessly with Azure AI Agent Service and Semantic Kernel. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Enterprise-grade reliability:</strong> Benefit from NVIDIA AI Enterprise support for continuous performance and security. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Scalable inference:</strong> Tap into Azure’s NVIDIA accelerated infrastructure for demanding workloads. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Optimized workflows:</strong> Accelerate applications ranging from large language models to advanced analytics. </li>\n</ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><img alt=\"A screenshot of a computer\" class=\"wp-image-39322\" height=\"720\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/NIM1.gif\" width=\"1280\" /></figure>\n\n\n\n<p class=\"wp-block-paragraph\">Deploying these services is simple. With just a few clicks—whether selecting models like the Llama-3.3-70B-NIM or others from the model catalog in Azure AI Foundry—you can integrate them directly into your AI workflows and start building generative AI applications that work flawlessly within the Azure ecosystem. </p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"optimizing-performance-with-nvidia-agentiq\">Optimizing performance with NVIDIA AgentIQ </h2>\n\n\n\n<p class=\"wp-block-paragraph\">Once your NVIDIA NIM microservices are deployed, NVIDIA AgentIQ takes center stage. This <a href=\"https://github.com/microsoft/semantic-kernel/tree/main/python/semantic_kernel/connectors/ai/nvidia\" rel=\"noreferrer noopener\" target=\"_blank\">open-source toolkit</a> is designed to seamlessly connect, profile, and optimize teams of AI agents, enables your systems to run at peak performance. AgentIQ delivers: </p>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Profiling and optimization:</strong> Leverage real-time telemetry to fine-tune AI agent placement, reducing latency and compute overhead. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Dynamic inference enhancements:</strong> Continuously collect and analyze metadata—such as predicted output tokens per call, estimated time to next inference, and expected token lengths—to dynamically improve agent performance. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Integration with Semantic Kernel:</strong> Direct integration with Azure AI Foundry Agent Service further empowers your agents with enhanced semantic reasoning and task execution capabilities. </li>\n</ul>\n\n\n<figure class=\"wp-block-image size-full\"><img alt=\"Image showing how NVIDIA NIM Models and Azure AI Agent Service can be used together to enable agentic apps. \" class=\"wp-image-39347 webp-format\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/Blog-Diagram.webp\" /></figure>\n\n\n\n<p class=\"wp-block-paragraph\">This intelligent profiling not only reduces compute costs but also boosts accuracy and responsiveness, so that every part of your agentic AI workflow is optimized for success. </p>\n\n\n\n<p class=\"wp-block-paragraph\">In addition, we will soon be integrating the NVIDIA Llama Nemotron Reason open reasoning model. NVIDIA Llama Nemotron Reason is a powerful AI model family designed for advanced reasoning. According to NVIDIA, Nemotron excels at coding, complex math, and scientific reasoning while understanding user intent and seamlessly calling tools like search and translations to accomplish tasks.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"real-world-impact\">Real-world impact </h2>\n\n\n\n<p class=\"wp-block-paragraph\">Industry leaders are already witnessing the benefits of these innovations. </p>\n\n\n\n<p class=\"wp-block-paragraph\">Drew McCombs, Vice President, Cloud and Analytics at Epic, noted: </p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-large-font-size wp-block-paragraph\">The launch of NVIDIA NIM microservices in Azure AI Foundry offers a secure and efficient way for Epic to deploy open-source generative AI models that improve patient care, boost clinician and operational efficiency, and uncover new insights to drive medical innovation. In collaboration with UW Health and UC San Diego Health, we&#8217;re also researching methods to evaluate clinical summaries with these advanced models. Together, we’re using the latest AI technology in ways that truly improve the lives of clinicians and patients.</p>\n</blockquote>\n\n\n\n<p class=\"wp-block-paragraph\">Epic’s experience underscores how our integrated solution can drive transformational change—not just in healthcare but across every industry where high-performance AI is a game changer. As noted by Jon Sigler, EVP, Platform and AI at ServiceNow:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-large-font-size wp-block-paragraph\">This combination of ServiceNow’s AI platform with NVIDIA NIM and Microsoft Azure AI Foundry and Azure AI Agent Service helps us bring to market industry-specific, out-of-the-box AI agents, delivering full-stack agentic AI solutions to help resolve problems faster, deliver great customer experiences, and accelerate improvements in organizations’ productivity and efficiency.</p>\n</blockquote>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"unlock-ai-powered-innovation\">Unlock AI-powered innovation </h2>\n\n\n\n<p class=\"wp-block-paragraph\">By combining the robust deployment capabilities of NVIDIA NIM with the dynamic optimization of NVIDIA AgentIQ, Azure AI Foundry provides a turnkey solution for building, deploying, and scaling enterprise-grade agentic applications. This integration can accelerate AI deployments, enhance agentic workflows, and reduce infrastructure costs—enabling you to focus on what truly matters: driving innovation. </p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"ready-to-accelerate-your-ai-journey\">Ready to accelerate your AI journey? </h2>\n\n\n\n<p class=\"wp-block-paragraph\">Deploy NVIDIA NIM microservices and <a href=\"https://github.com/microsoft/semantic-kernel/tree/main/python/semantic_kernel/connectors/ai/nvidia\" rel=\"noreferrer noopener\" target=\"_blank\">optimize your AI agents</a> with NVIDIA AgentIQ toolkit on <a href=\"https://azure.microsoft.com/en-us/products/ai-foundry\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Foundry</a>. Explore more about the Azure AI Foundry <a href=\"https://ai.azure.com/explore/models?tid=72f988bf-86f1-41af-91ab-2d7cd011db47\" rel=\"noreferrer noopener\" target=\"_blank\">model catalog</a>.</p>\n\n\n\n<p class=\"wp-block-paragraph\">Let’s build a smarter, faster, and more efficient future together. </p>\n\n\n\n<aside class=\"cta-block cta-block--align-left cta-block--has-image wp-block-msx-cta\">\n\t<div class=\"cta-block__content\">\n\t\t\t\t\t<div class=\"cta-block__image-container\">\n\t\t\t\t<img alt=\"Two people sitting with a laptop\" class=\"cta-block__image\" height=\"683\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2024/12/Picture1-1024x683.jpg\" width=\"1024\" />\t\t\t</div>\n\t\t\n\t\t<div class=\"cta-block__body\">\n\t\t\t<h2 class=\"cta-block__headline\">Azure AI Foundry</h2>\n\t\t\t<p class=\"cta-block__text\">Design, customize, and manage AI apps and agents at scale.</p>\n\t\t\t\t\t\t\t<div class=\"cta-block__actions\">\n\t\t\t\t\t<a class=\"btn cta-block__link btn-link\" href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">\n\t\t\t\t\t\tDiscover more &gt;\t\t\t\t\t</a>\n\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t</div>\n</aside>\n\n\n\n<p class=\"wp-block-paragraph\"></p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/accelerating-agentic-workflows-with-azure-ai-foundry-nvidia-nim-and-nvidia-agentiq/\">Accelerating agentic workflows with Azure AI Foundry, NVIDIA NIM, and NVIDIA AgentIQ</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>",
    "url": "https://azure.microsoft.com/en-us/blog/accelerating-agentic-workflows-with-azure-ai-foundry-nvidia-nim-and-nvidia-agentiq/",
    "published_date": "Tue, 18 Mar 2025 20:00:00 +0000",
    "processed": false
  },
  {
    "id": "https://azure.microsoft.com/en-us/blog/?p=39235",
    "title": "Microsoft and NVIDIA accelerate AI development and performance",
    "source": "Microsoft Azure Blog",
    "content": "<p class=\"wp-block-paragraph\">Together, Microsoft and NVIDIA are accelerating some of the most groundbreaking innovations in AI. This long-standing collaboration has been at the core of the AI revolution over the past few years, from bringing industry-leading supercomputing performance in the cloud to supporting breakthrough frontier models and solutions like ChatGPT in <a href=\"https://azure.microsoft.com/products/ai-services/openai-service\">Microsoft Azure OpenAI Service</a> and Microsoft Copilot.</p>\n\n\n\n<p class=\"wp-block-paragraph\">Today, there are several new announcements from Microsoft and NVIDIA that further enhance the full stack collaboration to help shape the future of AI. This includes integrating the newest NVIDIA Blackwell platform with Azure AI services infrastructure, incorporating <a href=\"https://developer.nvidia.com/nim?sortBy=developer_learning_library%2Fsort%2Ffeatured_in.nim%3Adesc%2Ctitle%3Aasc\" rel=\"noreferrer noopener\" target=\"_blank\">NVIDIA NIM microservices</a> into <a href=\"https://azure.microsoft.com/products/ai-foundry/\">Azure AI Foundry</a>, and empowering developers, startups, and organizations of all sizes like <a href=\"https://www.microsoft.com/en/customers/story/19758-national-basketball-association-azure-open-ai-service\" rel=\"noreferrer noopener\" target=\"_blank\">NBA</a>, <a href=\"https://www.microsoft.com/en/customers/story/19769-bmw-ag-azure-app-service\" rel=\"noreferrer noopener\" target=\"_blank\">BMW</a>, <a href=\"https://www.microsoft.com/en/customers/story/19582-dentsu-azure-kubernetes-service\" rel=\"noreferrer noopener\" target=\"_blank\">Dentsu</a>, <a href=\"https://www.microsoft.com/en/customers/story/19750-harvey-azure-open-ai-service\" rel=\"noreferrer noopener\" target=\"_blank\">Harvey</a> and <a href=\"https://www.microsoft.com/en/customers/story/1665511423001946809-OriGen-partner-professional-services-azure\" rel=\"noreferrer noopener\" target=\"_blank\">OriGen</a>, to accelerate their innovations and solve the most challenging problems across domains.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-2 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://aka.ms/AzureBlog/AzureGTC25\">Come see Microsoft at the NVIDIA GTC AI Conference</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"empowering-all-developers-and-innovators-with-agentic-ai\">Empowering all developers and innovators with agentic AI&nbsp;</h2>\n\n\n\n<p class=\"wp-block-paragraph\">Microsoft and NVIDIA collaborate deeply across the entire technology stack, and with the rise of agentic AI, they are thrilled to share several new offerings that are available in <a href=\"https://azure.microsoft.com/en-us/blog/accelerating-agentic-workflows-with-azure-ai-foundry-nvidia-nim-and-nvidia-agentiq/\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Foundry</a>. First is that <strong>Azure AI Foundry now offers NVIDIA NIM microservices.</strong> NIM provides optimized containers for more than two dozen popular foundation models, allowing developers to deploy generative AI applications and agents quickly. These new integrations can accelerate inferencing workloads for models available on Azure, providing significant performance improvements, greatly supporting the growing use of AI agents. Key features include optimized model throughput for NVIDIA accelerated computing platforms, prebuilt microservices deployable anywhere, and enhanced accuracy for specific use cases. In addition, we will soon be integrating the NVIDIA Llama Nemotron Reason open reasoning model. NVIDIA Llama Nemotron Reason is a powerful AI model family designed for advanced reasoning.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Epic, a leading electronic health record company,</strong> is planning to take advantage of the latest integration of NVIDIA NIM on Azure AI Foundry, improving AI applications to deliver better healthcare and patient results.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-large-font-size wp-block-paragraph\"><em>The launch of NVIDIA NIM microservices in Azure AI Foundry offers a secure and efficient way for Epic to deploy open-source generative AI models that improve patient care, boost clinician and operational efficiency, and uncover new insights to drive medical innovation. In collaboration with UW Health and UC San Diego Health, we&#8217;re also researching methods to evaluate clinical summaries with these advanced models. Together, we’re using the latest AI technology in ways that truly improve the lives of clinicians and patients.</em></p>\n\n\n\n<p class=\"has-large-font-size wp-block-paragraph\">Drew McCombs, VP Cloud and Analytics, Epic</p>\n</blockquote>\n\n\n\n<p class=\"wp-block-paragraph\">Further, Microsoft is also working closely with NVIDIA to optimize inference performance for popular, open-source language models and ensure they are available on Azure AI Foundry so customers can take full advantage of the performance and efficiency benefits from foundation models. The newest addition of this collaboration is the performance optimization for Meta Llama models <a href=\"https://aka.ms/Nvidiatensorrtllmblog\" rel=\"noreferrer noopener\" target=\"_blank\">using TensorRT-LLM</a>. Developers can now use the optimized Llama models from the model catalog in Azure AI Foundry to experience improvements in throughput without additional steps.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-large-font-size wp-block-paragraph\"><em><em>“At Synopsys, we rely on cutting-edge AI models to drive innovation, and the optimized Meta Llama models on Azure AI Foundry have delivered exceptional performance. We&#8217;ve seen substantial improvements in both throughput and latency, allowing us to accelerate our workloads while optimizing costs. These advancements make Azure AI Foundry an ideal platform for scaling AI applications efficiently.”</em></em></p>\n\n\n\n<p class=\"has-large-font-size wp-block-paragraph\">Arun Venkatachar, VP Engineering, Synopsys Central Engineering</p>\n</blockquote>\n\n\n\n<p class=\"wp-block-paragraph\">At the same time, Microsoft is excited to be expanding its model catalog in Azure AI Foundry even further with the addition of Mistral Small 3.1, which is coming soon, an enhanced version of Mistral Small 3, featuring multimodal capabilities and an extended context length of up to 128k.</p>\n\n\n\n<p class=\"wp-block-paragraph\">Microsoft is also announcing the <a href=\"https://aka.ms/NIMserverlessGPU\" rel=\"noreferrer noopener\" target=\"_blank\"><strong>general availability of Azure Container Apps serverless graphics processing units (GPUs) with support for NVIDIA NIM</strong></a>. Serverless GPUs allow enterprises, startups, and software development companies to seamlessly run AI workloads on-demand with automatic scaling, optimized cold start, and per-second billing with scale down to zero when not in use to reduce operational overhead. With the support of NVIDIA NIM, development teams can easily build and deploy generative AI applications alongside existing applications within the same networking, security, and isolation boundary.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"expanding-azure-ai-infrastructure-with-nvidia\">Expanding Azure AI Infrastructure with NVIDIA&nbsp;</h2>\n\n\n\n<p class=\"wp-block-paragraph\">The evolution of reasoning models and agentic AI systems is transforming the artificial intelligence landscape. Robust and purpose-built infrastructure is key to their success. Today, Microsoft is excited to announce the <strong><a href=\"https://aka.ms/GB200GA\" rel=\"noreferrer noopener\" target=\"_blank\">general availability of Azure ND GB200 V6 virtual machine (VM) series</a></strong> accelerated by NVIDIA GB200 NVL72 and NVIDIA Quantum InfiniBand networking. This addition to the Azure AI Infrastructure portfolio, alongside existing virtual machines that use NVIDIA H200 and NVIDIA H100 GPUs, highlight Microsoft&#8217;s commitment to optimizing infrastructure for the next wave of complex AI tasks like planning, reasoning, and adapting in real-time.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-large-font-size wp-block-paragraph\"><em>As we push the boundaries of AI, our partnership with Azure and the introduction of the NVIDIA Blackwell platform represent a significant leap forward. The NVIDIA GB200 NVL72, with its unparalleled performance and connectivity, tackles the most complex AI workloads, enabling businesses to innovate faster and more securely. By integrating this technology with Azure&#8217;s secure infrastructure, we are unlocking the potential of reasoning AI.</em></p>\n\n\n\n<p class=\"has-large-font-size wp-block-paragraph\">Ian Buck, Vice President of Hyperscale and HPC, NVIDIA</p>\n</blockquote>\n\n\n\n<p class=\"wp-block-paragraph\">The combination of high-performance NVIDIA GPUs with low-latency NVIDIA InfiniBand networking and Azure&#8217;s scalable architectures are essential to handle the new massive data throughput and intensive processing demands. Furthermore, comprehensive integration of security, governance, and monitoring tools from Azure supports powerful, trustworthy AI applications that comply with regulatory standards.</p>\n\n\n\n<p class=\"wp-block-paragraph\">Built with Microsoft&#8217;s custom infrastructure system and the NVIDIA Blackwell platform, at the datacenter level each blade features two <a href=\"https://www.nvidia.com/en-us/data-center/gb200-nvl72/%22HYPERLINK%20%22https://www.nvidia.com/en-us/data-center/gb200-nvl72/%22HYPERLINK%20%22https://www.nvidia.com/en-us/data-center/gb200-nvl72/\" rel=\"noreferrer noopener\" target=\"_blank\">NVIDIA GB200 Grace™ Blackwell Superchips</a> and <a href=\"https://www.nvidia.com/en-us/data-center/nvlink/\" rel=\"noreferrer noopener\" target=\"_blank\">NVIDIA NVLink™ Switch</a> scale-up networking, which supports up to 72 NVIDIA Blackwell GPUs in a single NVLink domain. Additionally, it incorporates the latest <a href=\"https://www.nvidia.com/en-us/networking/quantum2/\" rel=\"noreferrer noopener\" target=\"_blank\">NVIDIA Quantum InfiniBand</a>, allowing for scaling out to tens of thousands of Blackwell GPUs on Azure, providing two times the <a href=\"https://techcommunity.microsoft.com/blog/azurehighperformancecomputingblog/unpacking-the-performance-of-microsoft-azure-nd-gb200-v6-virtual-machines/4390442\" rel=\"noreferrer noopener\" target=\"_blank\">AI supercomputing performance</a> from previous GPU generations based on <a href=\"https://github.com/Azure/AI-benchmarking-guide/tree/main/Azure_Results\" rel=\"noreferrer noopener\" target=\"_blank\">GEMM benchmark analysis</a>.</p>\n\n\n\n<p class=\"wp-block-paragraph\">As Microsoft&#8217;s work with NVIDIA continues to grow and shape the future of AI, the company also looks forward to bringing the performance of <strong>NVIDIA Blackwell Ultra GPUs and the NVIDIA RTX PRO 6000 Blackwell Server Edition to Azure.</strong> Microsoft is set to launch the NVIDIA Blackwell Ultra GPU-based VMs later in 2025. These VMs promise to deliver exceptional performance and efficiency for the next wave of agentic and generative AI workloads.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<p class=\"wp-block-paragraph\">Azure AI&#8217;s infrastructure, advanced by NVIDIA accelerated computing, consistently delivers high performance at scale for AI workloads as evidenced by leading industry benchmarks like Top500 supercomputing and MLPerf results.<sup>1,2</sup> Recently, Azure Virtual Machines using NVIDIA&#8217;s H200 GPUs achieved exceptional performance in the <a href=\"https://github.com/mlcommons/training_results_v4.1/tree/main/Azure\" rel=\"noreferrer noopener\" target=\"_blank\">MLPerf Training v4.1 benchmarks</a> across various AI tasks. Azure demonstrated leading cloud performance by scaling 512 H200 GPUs in a cluster, achieving a <a href=\"https://aka.ms/Signal65WP_MLPerf\" rel=\"noreferrer noopener\" target=\"_blank\">28% speedup over H100 GPUs</a> in the latest MLPerf training runs by MLCommons.<sup>3</sup> This highlights Azure&#8217;s ability to efficiently scale large GPU clusters. Microsoft is excited that customers are utilizing this performance on Azure to train advanced models and get efficiency for generative inferencing.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"empowering-businesses-with-azure-ai-infrastructure\">Empowering businesses with Azure AI Infrastructure</h2>\n\n\n\n<p class=\"wp-block-paragraph\"><a href=\"http://meter.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Meter</a> is training a large foundation model on Azure AI Infrastructure to automate networking end-to-end. The performance and power of Azure will significantly scale Meter’s AI training and inference, aiding in the development of models with billions of parameters across text-based configurations, time-series telemetry, and structured networking data. With support from Microsoft, Meter&#8217;s models aim to improve how networks are designed, configured, and managed—addressing a significant challenge for progress.</p>\n\n\n\n<p class=\"wp-block-paragraph\"><a href=\"https://blackforestlabs.ai/\" rel=\"noreferrer noopener\" target=\"_blank\">Black Forest Labs</a>, a generative AI start-up with the mission to develop and advance state-of-the-art deep learning models for media, has extended its partnership with Azure. Azure AI services infrastructure is already being used to deploy its flagship FLUX models, the world’s most popular text-to-image media models, serving millions of high-quality images everyday with unprecedented speed and creative control. Building on this foundation, Black Forest Labs will adopt the new ND GB200 v6 VMs to accelerate the development and deployment of its next-gen AI models, pushing the boundaries of innovation in generative AI for media. Black Forest Labs has been a Microsoft partner since its inception, working together to secure the most advanced, efficient, and scalable infrastructure for training and delivering its frontier models.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-large-font-size wp-block-paragraph\"><em>We are expanding our partnership with Microsoft Azure to combine BFL&#8217;s unique research expertise in generative AI with Azure&#8217;s powerful infrastructure. This collaboration enables us to build and deliver the best possible image and video models faster and at greater scale, providing our customers with state-of-the-art visual AI capabilities for media production, advertising, product design, content creation and beyond. </em></p>\n\n\n\n<p class=\"has-large-font-size wp-block-paragraph\">Robin Rombach, CEO, Black Forest Labs</p>\n</blockquote>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"creating-new-possibilities-for-innovators-across-industries\">Creating new possibilities for innovators across industries</h2>\n\n\n\n<p class=\"wp-block-paragraph\">Microsoft and NVIDIA have launched preconfigured <a href=\"https://www.nvidia.com/en-us/omniverse/%22HYPERLINK%20%22https://www.nvidia.com/en-us/omniverse/\" rel=\"noreferrer noopener\" target=\"_blank\">NVIDIA Omniverse</a> and NVIDIA <a href=\"https://developer.nvidia.com/isaac/sim\" rel=\"noreferrer noopener\" target=\"_blank\">Isaac Sim</a> virtual desktop workstations, and <a href=\"https://azuremarketplace.microsoft.com/en-us/marketplace/apps/nvidia.ov_kit_app_streaming_application\" rel=\"noreferrer noopener\" target=\"_blank\">Omniverse Kit App Streaming</a>, on the Azure marketplace. Powered by Azure Virtual Machines using NVIDIA GPUs, these offerings provide developers everything they need to get started developing and self-deploying digital twin and robotics simulation applications and services for the era of physical AI. Several Microsoft and NVIDIA ecosystem partners including <a href=\"https://www.brightmachines.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Bright Machines</a>, <a href=\"https://kinetic-vision.com/omniverse/\" rel=\"noreferrer noopener\" target=\"_blank\">Kinetic Vision</a>, <a href=\"https://sightmachine.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Sight Machine</a>, and <a href=\"https://www.softserveinc.com/en-us\" rel=\"noreferrer noopener\" target=\"_blank\">SoftServe</a> are adopting these capabilities to build solutions that will enable the next wave of digitalization for the world’s manufacturers.</p>\n\n\n\n<p class=\"wp-block-paragraph\">There are many innovative solutions built by AI startups on Azure. <a href=\"https://www.opaque.co/\" rel=\"noreferrer noopener\" target=\"_blank\">Opaque Systems</a> helps customers safeguard their data using confidential computing; <a href=\"https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.faros.ai%2F&amp;data=05%7C02%7Cjasminechang%40microsoft.com%7C95b7f4b817744b00bf7208dd6578e114%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C638778292024407851%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=TtAXU3gk89Lh0V9L64IeXjFn8a%2F4Qp1OYMhPiegESMM%3D&amp;reserved=0%22%20\\o%20%22Original%20URL:%20https://www.faros.ai/.%20Click%20or%20tap%20if%20you%20trust%20this%20link.\" rel=\"noreferrer noopener\" target=\"_blank\">Faros AI</a> provides software engineering insights, allowing customers to optimize resources and enhance decision-making, including measuring the ROI of their AI coding assistants; <a href=\"https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fbria.ai%2F&amp;data=05%7C02%7Cjasminechang%40microsoft.com%7C95b7f4b817744b00bf7208dd6578e114%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C638778292024420331%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=Z1DO22qaZcaETfcOoA91js%2F8qrNy68eEq4UJ47o8nVY%3D&amp;reserved=0%22%20\\o%20%22Original%20URL:%20https://bria.ai/.%20Click%20or%20tap%20if%20you%20trust%20this%20link.\" rel=\"noreferrer noopener\" target=\"_blank\">Bria AI</a> provides a visual generative AI platform that allows developers to use AI image generation responsibly, providing cutting-edge models trained exclusively on fully-licensed datasets; <a href=\"https://www.pangaeadata.ai/\" rel=\"noreferrer noopener\" target=\"_blank\">Pangaea Data</a> is&nbsp;delivering better patient outcomes by enhancing screening and treatment at the point of care; and <a href=\"https://basecamp-research.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Basecamp Research</a> is driving biodiversity discovery with AI and extensive genomic datasets.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"experience-the-latest-innovations-from-azure-and-nvidia\">Experience the latest innovations from Azure and NVIDIA&nbsp;</h2>\n\n\n\n<p class=\"wp-block-paragraph\">Today’s announcements at the NVIDIA GTC AI Conference underscore Azure&#8217;s commitment to pushing the boundaries of AI innovations. With state-of-the-art products, deep collaboration, and seamless integrations, we continue to deliver the technology that supports and empowers developers and customers in designing, customizing, and deploying their AI solutions efficiently. Learn more at this year’s event and explore the possibilities that NVIDIA and Azure hold for the future.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Visit us at Booth 514 at NVIDIA GTC.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Attend <a href=\"https://aka.ms/TechComm/AzureGTC25\">Microsoft sessions at NVIDIA GTC</a>.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Explore <a href=\"https://ai.azure.com/\">Azure AI Foundry</a>.</li>\n</ul>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Sources</strong>:</p>\n\n\n\n<p class=\"wp-block-paragraph\"><sup>1</sup><a href=\"https://www.top500.org/lists/top500/2024/11/\">November 2024 | TOP500</a></p>\n\n\n\n<p class=\"wp-block-paragraph\"><sup>2</sup><a href=\"https://mlcommons.org/benchmarks/\">Benchmark Work | Benchmarks MLCommons</a></p>\n\n\n\n<p class=\"wp-block-paragraph\"><sup>3</sup><a href=\"https://signal65.com/research/ai/leading-ai-scalability-benchmarks-with-microsoft-azure/\">Leading AI Scalability Benchmarks with Microsoft Azure &#8211; Signal65</a></p>\n\n\n\n<p class=\"wp-block-paragraph\"></p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-and-nvidia-accelerate-ai-development-and-performance/\">Microsoft and NVIDIA accelerate AI development and performance  </a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>",
    "url": "https://azure.microsoft.com/en-us/blog/microsoft-and-nvidia-accelerate-ai-development-and-performance/",
    "published_date": "Tue, 18 Mar 2025 20:00:00 +0000",
    "processed": false
  },
  {
    "id": "https://azure.microsoft.com/en-us/blog/?p=39230",
    "title": "Cutting digital curbs: How Azure AI Foundry is building a more accessible world",
    "source": "Microsoft Azure Blog",
    "content": "<p class=\"wp-block-paragraph\">When my wife and I had our first child, I started seeing the world differently. Pushing a stroller through our neighborhood, I quickly realized how much I had taken for granted—sidewalks that suddenly ended, intersections without curb cuts, pathways that were technically walkable but not built for wheels.</p>\n\n\n\n<p class=\"wp-block-paragraph\">It wasn’t just a minor inconvenience. It made me think about my elderly grandmother, who relied on a walker. And my parents, who are active now but won’t always move as easily as they do today. Mobility and accessibility are deeply connected, and for the first time, I saw how infrastructure shapes our daily experiences—whether we notice it or not.</p>\n\n\n\n<p class=\"wp-block-paragraph\">But physical mobility is only part of the equation. In the digital world, there are just as many curbs that need cutting. Websites that don’t work with screen readers. Captions that lag behind real-time speech. AI models that fail to understand diverse voices. These barriers may be invisible to many, but they create real limitations for millions of people.</p>\n\n\n\n<p class=\"wp-block-paragraph\">And just like curb cuts in sidewalks, digital accessibility doesn’t just benefit one group—it makes technology better for everyone. That’s where <a href=\"https://azure.microsoft.com/en-us/products/ai-foundry\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Foundry</a>, <a href=\"https://azure.microsoft.com/en-us/products/ai-services/openai-service\" rel=\"noreferrer noopener\" target=\"_blank\">Azure OpenAI Service</a>, and the latest innovations in <a href=\"https://azure.microsoft.com/en-us/products/ai-services\" rel=\"noreferrer noopener\" target=\"_blank\">multimodal AI</a> and <a href=\"https://azure.microsoft.com/en-us/solutions/ai/responsible-ai-with-azure\" rel=\"noreferrer noopener\" target=\"_blank\">Responsible AI (RAI)</a> come in—helping organizations cut digital curbs and build a world that works for all.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img alt=\"Inclusive and accessible experiences empower everyone.\" class=\"wp-image-39294\" height=\"720\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/Slide6.jpg\" width=\"1280\" /></figure>\n\n\n\n<p class=\"wp-block-paragraph\">As we recognize the impact of accessibility innovation at Microsoft’s <a href=\"https://abilitysummit.microsoft.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Ability Summit 2025</a>, we encourage you to explore how AI can drive greater inclusion in your products and services. </p>\n\n\n\n<p class=\"wp-block-paragraph\">The goal isn’t just to eliminate obstacles—it’s to design a world where everyone moves forward together. Here are some of my favorite real-world examples.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-3 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">Build with Azure AI Foundry today</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"real-world-impact-how-azure-ai-is-cutting-digital-curbs\">Real-world impact: How Azure AI is cutting digital curbs</h2>\n\n\n\n<p class=\"wp-block-paragraph\">The curb cuts of digital accessibility didn’t start with generative AI—Microsoft has been building inclusive technologies for decades. From early screen readers to speech-to-text innovations, AI has long played a pivotal role in expanding access. But now, we’re going even bigger. </p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"bridging-the-mental-health-gap-with-ai-powered-conversations-technology-azure-ai\">Bridging the mental health gap with AI-powered conversations </h3>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Technology: Azure AI</strong></p>\n\n\n\n<p class=\"wp-block-paragraph\">Mental health support is a growing necessity worldwide, but in Kenya, where there are only about 100 psychiatrists for a population of 50 million, access to professional care is extremely limited. Financial and cultural barriers often keep people from seeking the help they need.</p>\n\n\n\n<p class=\"wp-block-paragraph\"><a href=\"https://www.microsoft.com/en/customers/story/19682-kenya-red-cross-society-azure-ai-services\" rel=\"noreferrer noopener\" target=\"_blank\">Kenya Red Cross</a> saw an opportunity to bridge this gap using Azure AI-powered chatbots. In partnership with Pathways Technologies, they developed Chat Care, an AI-based mental health assistant that provides guidance, emotional support, and referrals—all in English and Swahili.</p>\n\n\n\n<p class=\"wp-block-paragraph\">This isn’t just a chatbot; it’s a lifeline for people who may otherwise suffer in silence. Chat Care allows users to start conversations about their mental health in a low-pressure, anonymous way, reducing stigma and offering resources that are accessible 24/7. It can suggest breathing exercises, gratitude practices, and in-person services, all tailored to the user’s responses.</p>\n\n\n\n<p class=\"wp-block-paragraph\">And for people who are deaf, hard of hearing, or unable to speak on the phone, Chat Care offers text-based support, ensuring mental health services are available to everyone, regardless of ability or circumstance.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"improving-ai-speech-recognition-for-non-standard-speech\">Improving AI speech recognition for non-standard speech</h3>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Technology: Azure AI Speech x UIUC Partnership</strong></p>\n\n\n\n<p class=\"wp-block-paragraph\">Voice recognition technology often struggles to understand people with non-standard speech patterns, making it harder for individuals with conditions like cerebral palsy or amyotrophic lateral sclerosis (ALS) to interact with AI-powered experiences.</p>\n\n\n\n<p class=\"wp-block-paragraph\">To solve this, Microsoft partnered with the University of Illinois Urbana-Champaign and fellow tech leaders to build the <a href=\"https://speechaccessibilityproject.beckman.illinois.edu/\" rel=\"noreferrer noopener\" target=\"_blank\">Speech Accessibility Project</a>—a research initiative to train AI models that recognize diverse speech patterns.</p>\n\n\n\n<p class=\"wp-block-paragraph\">By integrating this breakthrough into <a href=\"https://azure.microsoft.com/en-us/products/ai-services/ai-speech\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Speech</a>, Microsoft is ensuring that AI-powered voice technology works for everyone, making digital experiences more inclusive across industries.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"making-ai-more-accessible-from-the-ground-up\">Making AI more accessible from the ground up</h3>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Technology: Azure AI Foundry</strong></p>\n\n\n\n<p class=\"wp-block-paragraph\">With Azure AI Foundry, Microsoft has embedded accessibility into the AI development lifecycle itself. By partnering with <a href=\"https://www.microsoft.com/en/customers/story/19581-ey-azure-ai-studio\" rel=\"noreferrer noopener\" target=\"_blank\">EY</a>, the Azure AI Foundry now empowers neurodivergent customers, and features improved usability, reducing cognitive overload and improving navigation for all people.</p>\n\n\n\n<p class=\"wp-block-paragraph\">In 2024, <a href=\"https://ai.azure.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Foundry</a> reached a milestone for usability, reflecting feedback from people with disabilities that helped improve the platform. The updates included:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Grouping notifications and deployment errors to reduce cognitive overload.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Ensuring screen readers provide structured, easy-to-follow AI workflows.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Enhancing keyboard navigation for people who rely on shortcuts over mouse input.</li>\n</ul>\n\n\n\n<p class=\"wp-block-paragraph\">This is a prime example of why accessibility is about building better, more intuitive technology for everyone.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"making-accessible-ai-work-for-agents\">Making accessible AI work for agents</h2>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Technology: Computer-Using Agent (CUA)</strong></p>\n\n\n\n<p class=\"wp-block-paragraph\">Microsoft’s <a href=\"https://azure.microsoft.com/en-us/blog/announcing-the-responses-api-and-computer-using-agent-in-azure-ai-foundry/\">Computer-Using Agent (CUA)</a> in Azure AI Foundry enables AI-powered automation of digital interactions, making software more accessible for people with limited mobility or dexterity. By allowing CUA to navigate interfaces, complete multi-step tasks, and execute actions through natural language commands, it reduces reliance on traditional keyboard and mouse inputs.</p>\n\n\n\n<p class=\"wp-block-paragraph\">This breakthrough enhances <strong>digital accessibility</strong>, empowering people who use any kind of assistive technology. As CUA dynamically interprets UI elements, it makes it easier to navigate applications and workflows.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"hope-action-and-moving-forward-together-with-azure-ai\">Hope, action, and moving forward together with Azure AI</h2>\n\n\n\n<p class=\"wp-block-paragraph\">There are days when it feels like progress is slow. That accessibility, whether physical or digital, takes too long to improve. But then I think about something as simple as the sidewalks at my cross streets.</p>\n\n\n\n<p class=\"wp-block-paragraph\">Not that long ago, they were completely inaccessible. But after making a call, filing a report, and pushing the issue, those sidewalks finally got curb cuts just in time for the birth of our second child. It was a small fix in the grand scheme of things, but it made a real difference.</p>\n\n\n\n<p class=\"wp-block-paragraph\">The truth is, sometimes it just takes someone noticing the problem and taking action. But I also know I say that from a place of privilege—I had the time, the resources, and the ability to advocate for that change. Many people don’t. That’s why it’s so important that we build accessibility into our systems from the start—so that no one has to fight for the basics.</p>\n\n\n\n<p class=\"wp-block-paragraph\">With <a href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">Azure AI Foundry</a>, organizations can now scale accessibility faster than ever, making the digital world more navigable, usable, and welcoming to all. The curb cuts are being built—and the future of accessibility is wide open.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img alt=\"A screenshot of a screen\" class=\"wp-image-39292\" height=\"720\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/Slide10.jpg\" width=\"1280\" /></figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"join-us-at-ability-summit-2025\">Join us at Ability Summit 2025</h2>\n\n\n\n<p class=\"wp-block-paragraph\">As we celebrate innovation at Microsoft’s <a href=\"https://abilitysummit.microsoft.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Ability Summit 2025</a>, we invite you to explore how AI can enhance accessibility in your products and services.</p>\n\n\n\n<p class=\"wp-block-paragraph\">The future isn’t just about removing barriers—it’s about building a world where everyone moves forward together. </p>\n\n\n\n<aside class=\"cta-block cta-block--align-left cta-block--has-image wp-block-msx-cta\">\n\t<div class=\"cta-block__content\">\n\t\t\t\t\t<div class=\"cta-block__image-container\">\n\t\t\t\t<img alt=\"A man lying on a bed with a tablet\" class=\"cta-block__image\" height=\"683\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/MSC25-trend-wellbeing-Getty-1384759590-rgb-1024x683.jpg\" width=\"1024\" />\t\t\t</div>\n\t\t\n\t\t<div class=\"cta-block__body\">\n\t\t\t<h2 class=\"cta-block__headline\">Join us for the fifteenth annual Ability Summit</h2>\n\t\t\t<p class=\"cta-block__text\">The 2025 Ability Summit is a free digital event where you will find the latest in AI and accessibility</p>\n\t\t\t\t\t\t\t<div class=\"cta-block__actions\">\n\t\t\t\t\t<a class=\"btn cta-block__link btn-link\" href=\"https://abilitysummit.microsoft.com/\" target=\"_blank\">\n\t\t\t\t\t\tClick here to join &gt;\t\t\t\t\t</a>\n\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t</div>\n</aside>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/cutting-digital-curbs-how-azure-ai-foundry-is-building-a-more-accessible-world/\">Cutting digital curbs: How Azure AI Foundry is building a more accessible world</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>",
    "url": "https://azure.microsoft.com/en-us/blog/cutting-digital-curbs-how-azure-ai-foundry-is-building-a-more-accessible-world/",
    "published_date": "Mon, 17 Mar 2025 15:00:00 +0000",
    "processed": false
  },
  {
    "id": "https://azure.microsoft.com/en-us/blog/?p=39119",
    "title": "Microsoft Cost Management updates—March 2025",
    "source": "Microsoft Azure Blog",
    "content": "<aside class=\"table-of-contents-block accordion pb-0\" id=\"accordion-5cf2e4a9-c5cd-4fc5-8178-801e3c04f6f8\">\n\t<button class=\"btn btn-collapse mb-0 display-flex justify-content-between w-100\" type=\"button\">\n\t\t<span class=\"table-of-contents-block__label subtitle\">In this article</span>\n\t\t<span class=\"table-of-contents-block__current mr-4 text-gray-600 font-weight-normal\"></span>\n\n\t\t<svg class=\"table-of-contents-block__arrow\" fill=\"none\" height=\"11\" viewBox=\"0 0 18 11\" width=\"18\" xmlns=\"http://www.w3.org/2000/svg\">\n\t\t\t<path d=\"M15.7761 11L18 8.82043L9 0L0 8.82043L2.22394 11L9 4.35913L15.7761 11Z\" fill=\"currentColor\">\n\t\t</svg>\n\t</button>\n\t<div class=\"table-of-contents-block__collapse-wrapper collapse show\" id=\"accordion-collapse-5cf2e4a9-c5cd-4fc5-8178-801e3c04f6f8\">\n\t\t<div class=\"accordion-body p-0\">\n\t\t\t<ol class=\"table-of-contents-block__list\"><li class=\"table-of-contents-block__list-item\"><a class=\"table-of-contents-block__list-item-link\" href=\"https://azure.microsoft.com/en-us/blog/feed/#optimizing-aks-azure-kubernetes-service-costs\">Optimizing AKS (Azure Kubernetes Service) costs </a></li><li class=\"table-of-contents-block__list-item\"><a class=\"table-of-contents-block__list-item-link\" href=\"https://azure.microsoft.com/en-us/blog/feed/#aws-azure-web-services-connector-deprecation\">AWS (Azure Web Services) connector deprecation</a></li><li class=\"table-of-contents-block__list-item\"><a class=\"table-of-contents-block__list-item-link\" href=\"https://azure.microsoft.com/en-us/blog/feed/#exchange-of-azure-openai-service-provisioned-reservations\">Exchange of Azure OpenAI Service Provisioned Reservations</a></li><li class=\"table-of-contents-block__list-item\"><a class=\"table-of-contents-block__list-item-link\" href=\"https://azure.microsoft.com/en-us/blog/feed/#help-shape-the-future-of-cost-reporting\">Help shape the future of cost reporting</a></li><li class=\"table-of-contents-block__list-item\"><a class=\"table-of-contents-block__list-item-link\" href=\"https://azure.microsoft.com/en-us/blog/feed/#documentation-updates-1\">Documentation updates</a></li><li class=\"table-of-contents-block__list-item\"><a class=\"table-of-contents-block__list-item-link\" href=\"https://azure.microsoft.com/en-us/blog/feed/#what-s-next-for-cost-management-1\">What&#039;s next for Cost Management?</a></li></ol>\t\t</div>\n\t</div>\n\t<span class=\"table-of-contents-block__progress-bar\"></span>\n</aside>\n\n\n\n<p class=\"wp-block-paragraph\">Whether you&#8217;re a new student, a thriving startup, or the largest enterprise, you have financial constraints, and you need to know what you&#8217;re spending, where it’s being spent, and how to plan for the future. Nobody wants a surprise when it comes to the bill, and this is where <a href=\"https://azure.microsoft.com/services/cost-management/\" rel=\"noreferrer noopener\" target=\"_blank\">Microsoft Cost Management</a> comes in.&nbsp;</p>\n\n\n\n<p class=\"wp-block-paragraph\">We&#8217;re always looking for ways to learn more about your challenges and how Microsoft Cost Management can help you better understand where you&#8217;re accruing costs in the cloud, identify and prevent bad spending patterns, and optimize costs to empower you to do more with less. Here are a few of the latest improvements and updates based on your feedback:&nbsp;</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-4 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/products/cost-management\">Manage your cloud cost with confidence — Microsoft Cost Management</a></div>\n</div>\n\n\n\n<p class=\"wp-block-paragraph\"><a id=\"_New_fields_for\"></a><em>Let&#8217;s dig into the details</em>:</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"optimizing-aks-azure-kubernetes-service-costs\">Optimizing AKS (Azure Kubernetes Service) costs&nbsp;</h2>\n\n\n\n<p class=\"wp-block-paragraph\">Running your applications on AKS clusters can significantly reduce costs by optimizing resource utilization, enabling autoscaling, and facilitating shared infrastructure. AKS allows you to set resource limits, ensuring efficient use of resources and preventing over-provisioning. Its autoscaling features adjust the number of pods and nodes based on demand, so you only pay for what you need. By managing data transfer and inter-cluster communication efficiently, AKS helps lower networking costs. Additionally, you can run multiple applications on the same cluster, reducing the need for separate infrastructure.</p>\n\n\n\n<aside class=\"wp-block-msx-kicker-container\">\n\t<div class=\"wp-block-msx-kicker wp-block-msx-kicker--align-right\">\n\t\t<p class=\"wp-block-msx-kicker__title\">Amplify human ingenuity</p>\n\t\t<a class=\"wp-block-msx-kicker__cta btn btn-link\" href=\"https://azure.microsoft.com/en-us/\">\n\t\t\t<span>Microsoft Azure</span> <span class=\"glyph-append glyph-append-xsmall wp-block-msx-kicker__glyph glyph-append-go\"></span>\n\t\t</a>\n\t</div>\n</aside>\n\n\n\n<p class=\"wp-block-paragraph\">In <a href=\"https://aka.ms/costanalysis\" rel=\"noreferrer noopener\" target=\"_blank\">Cost analysis,</a> you can use Kubernetes views to get visibility into the granular costs of your AKS clusters. The views provide you with visibility into the costs of namespaces running on your clusters and an aggregated view of costs of all resources running in your clusters. You simply need to install the <a href=\"https://learn.microsoft.com/en-us/azure/aks/cost-analysis\" rel=\"noreferrer noopener\" target=\"_blank\">cost analysis add-on</a> to your cluster to enable this experience for your Azure subscriptions.</p>\n\n\n\n<p class=\"wp-block-paragraph\">These views also provide you with visibility into the Idle costs of your clusters. Idle costs, in simple terms, imply that you are not fully utilizing the capacity of your resources, resulting in under-utilization.</p>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Assets view showing Idle costs per asset: </strong></p>\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img alt=\"A screenshot of a computer\" class=\"wp-image-39216 webp-format\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/bd2fe918-fd6a-4034-be14-621356fa3a39.webp\" /></figure>\n\n\n\n<p class=\"wp-block-paragraph\"><strong>Namespaces view showing Idle charges for the cluster: </strong></p>\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img alt=\"A screenshot of a notebook\" class=\"wp-image-39215 webp-format\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2025/03/e163ffa3-e292-4b32-8c52-e5a68abc23c7.webp\" /></figure>\n\n\n\n<p class=\"wp-block-paragraph\">The good news is that Azure provides you with different tools to minimize your Idle costs, and I strongly recommend you use the rich toolset for optimizing your AKS costs. You can set up your clusters and applications for <strong>autoscaling</strong> to minimize waste, use <strong>node auto provisioning</strong> for deciding the optimal VM configuration, and use <em>Azure Monitor managed service for Prometheus </em>to monitor utilization metrics. You can also optimize your VM costs by leveraging Spot VMs and taking advantage of savings instruments like Reservations and Savings Plans. </p>\n\n\n\n<aside class=\"wp-block-msx-kicker-container\">\n\t<div class=\"wp-block-msx-kicker wp-block-msx-kicker--align-right\">\n\t\t<p class=\"wp-block-msx-kicker__title\">Best practices for cost optimization in AKS</p>\n\t\t<a class=\"wp-block-msx-kicker__cta btn btn-link\" href=\"https://learn.microsoft.com/en-us/azure/aks/best-practices-cost\">\n\t\t\t<span>Learn more</span> <span class=\"glyph-append glyph-append-xsmall wp-block-msx-kicker__glyph glyph-append-go\"></span>\n\t\t</a>\n\t</div>\n</aside>\n\n\n\n<p class=\"wp-block-paragraph\">All the options available to you for optimizing AKS costs are explained very well in the article below:</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"aws-azure-web-services-connector-deprecation\"><a id=\"_Copilot_nudges\"></a>AWS (Azure Web Services) connector deprecation</h2>\n\n\n\n<p class=\"wp-block-paragraph\">The Connector for AWS, once built to consolidate Microsoft Azure and AWS cloud cost data in Microsoft Cost Management, <strong>will be retired on March 31st, 2025</strong>. You will lose access to the connector, and AWS cost and usage data stored in the cost management service, including historical data, will be removed. Please note that we won’t be deleting the Cost and Usage Report (CUR) files you stored in your S3 bucket in the AWS console as part of the connector setup. </p>\n\n\n\n<p class=\"wp-block-paragraph\">Please transition to your choice of cost management reporting for AWS and follow <a href=\"https://review.learn.microsoft.com/en-us/azure/cost-management-billing/costs/retire-aws-connector?branch=pr-en-us-267352#delete-budgets-that-monitor-aws-charges\" rel=\"noreferrer noopener\" target=\"_blank\">our instructions</a> to delete your Connector to AWS in the Azure Portal.</p>\n\n\n\n<p class=\"wp-block-paragraph\">As covered in one of our <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-cost-management-updates-november-2024/#Exports-to-Microsoft-Fabric\">previous blogs</a>, exporting data in standard FOCUS (FinOps Cost and Usage Specification) format and using an analytics and reporting solution like <a href=\"https://www.microsoft.com/en-us/microsoft-fabric\" rel=\"noreferrer noopener\" target=\"_blank\">Microsoft Fabric</a> is a great way to analyze and report on costs from different sources. </p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"exchange-of-azure-openai-service-provisioned-reservations\">Exchange of Azure OpenAI Service Provisioned Reservations</h2>\n\n\n\n<p class=\"wp-block-paragraph\">As you perhaps already know, you can enjoy substantial discounts with Azure OpenAI provisioned reservations compared to standard pay-as-you-go pricing. You can lock in lower rates for dedicated capacity, ensuring you have the resources needed to run your powerful AI models. Last month (February 2025), for added flexibility to manage your reservations, <em>we enabled exchange for provisioned reservations directly in the Azure portal.</em> You still have the option to request a refund. To learn more about managing your reservations, please refer to <a href=\"https://learn.microsoft.com/en-us/azure/cost-management-billing/reservations/azure-openai#cancel-exchange-or-refund\">this article</a>.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"help-shape-the-future-of-cost-reporting\"><a id=\"_Learning_FOCUS:_Introducing\"></a>Help shape the future of cost reporting</h2>\n\n\n\n<p class=\"wp-block-paragraph\">If you optimize cloud costs in your day-to-day work, from <em>monitoring costs to managing commitments</em>, we would love to hear from you. (All experience levels welcome!) Please take a few moments to complete this short, 5–10-minute survey to help us understand your roles, responsibilities, and what’s most important to you when optimizing in the cloud. Your feedback will help us improve our products and services to better meet your needs.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-5 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button is-style-chevron-right\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://aka.ms/CostOptimizationSurvey\">Click here to complete the Cost Optimization Survey</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"documentation-updates-1\"><a id=\"_New_ways_to\"></a>Documentation updates</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">Here are a few documentation updates you might be interested in: \n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\">New: <a href=\"https://learn.microsoft.com/azure/cost-management-billing/understand/billing-meter-location\" rel=\"noreferrer noopener\" target=\"_blank\">Shared billing meter regions</a>.</li>\n\n\n\n<li class=\"wp-block-list-item\">New: <a href=\"https://learn.microsoft.com/azure/cost-management-billing/manage/microsoft-entra-id-free\">Microsoft Entra ID</a> free.</li>\n\n\n\n<li class=\"wp-block-list-item\">Updated: View your usage summary details and download reports for <a href=\"https://learn.microsoft.com/azure/cost-management-billing/manage/direct-ea-azure-usage-charges-invoices\">EA enrollments</a>.</li>\n\n\n\n<li class=\"wp-block-list-item\">Updated: Save costs with<a href=\"https://learn.microsoft.com/azure/cost-management-billing/reservations/fabric-capacity\"> Microsoft Fabric Capacity</a> reservations.</li>\n\n\n\n<li class=\"wp-block-list-item\">Want to keep an eye on all documentation updates? Check out <span style=\"margin: 0px; padding: 0px;\">the change history of the <a href=\"https://github.com/MicrosoftDocs/azure-docs/commits/main/articles/cost-management-billing\" target=\"_blank\">Cost Management and Billing documentation</a> in the Azure Docs</span> repository on GitHub. If you see something missing, select Edit at the top of the document and submit a quick pull request. You can also submit a GitHub issue. We welcome and appreciate all contributions! </li>\n</ul>\n</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"what-s-next-for-cost-management-1\">What&#8217;s next for Cost Management?</h2>\n\n\n\n<p class=\"wp-block-paragraph\">These are just a few of the big updates from last month. Don&#8217;t forget to check out the <a href=\"https://aka.ms/costmgmt/blog\" rel=\"noreferrer noopener\" target=\"_blank\">previous Microsoft Cost Management updates</a>. We&#8217;re always listening and making constant improvements based on your feedback, so please keep the feedback coming.</p>\n\n\n\n<aside class=\"cta-block cta-block--align-left cta-block--has-image wp-block-msx-cta\">\n\t<div class=\"cta-block__content\">\n\t\t\t\t\t<div class=\"cta-block__image-container\">\n\t\t\t\t<img alt=\"Man sitting at desk with 2 computer monitors\" class=\"cta-block__image\" height=\"605\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2024/12/1.16-CTA-Correct.jpg\" width=\"600\" />\t\t\t</div>\n\t\t\n\t\t<div class=\"cta-block__body\">\n\t\t\t<h2 class=\"cta-block__headline\">Microsoft Cost Management</h2>\n\t\t\t<p class=\"cta-block__text\">Manage your cloud cost with confidence</p>\n\t\t\t\t\t\t\t<div class=\"cta-block__actions\">\n\t\t\t\t\t<a class=\"btn cta-block__link btn-link\" href=\"https://azure.microsoft.com/en-us/products/cost-management\">\n\t\t\t\t\t\tTry now &gt;\t\t\t\t\t</a>\n\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t</div>\n</aside>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/microsoft-cost-management-updates-march-2025/\">Microsoft Cost Management updates—March 2025</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>",
    "url": "https://azure.microsoft.com/en-us/blog/microsoft-cost-management-updates-march-2025/",
    "published_date": "Wed, 12 Mar 2025 15:00:00 +0000",
    "processed": false
  },
  {
    "id": "https://azure.microsoft.com/en-us/blog/?p=39100",
    "title": "Announcing the Responses API and Computer-Using Agent in Azure AI Foundry",
    "source": "Microsoft Azure Blog",
    "content": "<p class=\"wp-block-paragraph\">AI agents are transforming industries by automating workflows, enhancing productivity, and enabling intelligent decision-making. Businesses are leveraging AI agents to process insurance claims, manage IT service desks, optimize supply chain logistics, and even assist healthcare professionals in analyzing medical records. The potential is vast, and we’re excited to introduce two powerful innovations in <a href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">Azure AI Foundry</a>:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Responses API</strong>: A powerful API enabling AI-powered applications to retrieve information, process data, and take action seamlessly.</li>\n\n\n\n<li class=\"wp-block-list-item\"><strong>Computer-Using Agent (CUA)</strong>: A breakthrough AI model that navigates software interfaces, executes tasks, and automates workflows.</li>\n</ul>\n\n\n\n<p class=\"wp-block-paragraph\">Together, these capabilities empower businesses to reimagine AI not just as an assistant—but as an active digital workforce. Enterprise customers will soon gain access to these innovations driving automation, efficiency, and intelligence at scale.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n\n</div></figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"enhancing-ai-agents-with-the-responses-api-1\">Enhancing AI Agents with the Responses API&nbsp;</h2>\n\n\n\n<p class=\"wp-block-paragraph\">The Responses API is the key to unlocking agentic AI in Azure AI Foundry, transforming how enterprises harness AI for real-world impact. It is the new foundation for leveraging Azure OpenAI Service’s powerful built-in tools, combining the simplicity of the Chat Completions API with the advanced capabilities available through Assistants API and Azure AI Agent Service. The Responses API enables seamless interaction with tools like CUA, function calling, and file search—all in a single API call. This API enables AI systems to retrieve data, process information, and take actions—seamlessly connecting agentic AI with enterprise workflows. </p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-6 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">Build with Azure AI Foundry</a></div>\n</div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"how-the-responses-api-works-1\">How the Responses API Works&nbsp;</h3>\n\n\n\n<p class=\"wp-block-paragraph\">The Responses API provides a structured response format that allows AI to interact with multiple tools while maintaining context across interactions. It supports:&nbsp;</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Tool calling in one simple API call</strong>: Now, developers can seamlessly integrate AI tools, making execution more efficient.&nbsp;</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Computer use</strong>: Use the computer use tool within the Responses API to drive automation and execute software interactions.&nbsp;</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>File search</strong>: Interact with enterprise data dynamically and extract relevant information. </li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Function calling</strong>: Develop and invoke custom functions to enhance AI capabilities.&nbsp;</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Chaining responses into conversations</strong>: Keep track of interactions by linking responses together using unique response IDs, ensuring continuity in AI-driven dialogues.&nbsp;</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Enterprise-grade data privacy</strong>: Built with Azure’s trusted security and compliance standards, ensuring data protection for organizations.&nbsp;</li>\n</ul>\n\n\n\n<p class=\"wp-block-paragraph\">By consolidating retrieval, reasoning, and action execution into a single API, the Responses API simplifies AI agent development, reducing the complexity of orchestrating multiple AI tools within an automation pipeline. </p>\n\n\n\n<p class=\"wp-block-paragraph\">This scalability makes it well-suited for enterprise use cases across industries such as customer service, IT operations, finance, and supply chain management, where AI-powered automation can streamline workflows and improve efficiency. For even greater flexibility and control, organizations can explore <a href=\"https://learn.microsoft.com/en-us/azure/ai-services/agents/overview\" rel=\"noreferrer noopener\" target=\"_blank\">Azure AI Agent Service</a>, which offers additional tools and models for developing and scaling AI agents. Azure AI Agent Service integrates with <a href=\"https://techcommunity.microsoft.com/blog/educatordeveloperblog/using-azure-ai-agent-service-with-autogen--semantic-kernel-to-build-a-multi-agen/4363121\" rel=\"noreferrer noopener\" target=\"_blank\">Semantic Kernel and AutoGen</a>, enabling seamless multi-agent orchestration for more complex scenarios requiring multiple agents to collaborate on tasks.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"empowering-ai-agents-with-the-computer-using-agent\">Empowering AI Agents with the Computer-Using Agent</h2>\n\n\n\n<p class=\"wp-block-paragraph\">The Computer-Using Agent (CUA) is a specialized AI model in <a href=\"https://azure.microsoft.com/en-us/products/ai-services/openai-service\">Azure OpenAI Service</a> that allows AI to interact with graphical user interfaces (GUIs), navigate applications, and automate multi-step tasks—all through natural language instructions. Unlike traditional automation tools that rely on predefined scripts or API-based integrations, CUA can interpret visual elements, adapt dynamically, and take action based on on-screen content.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-7 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/products/ai-services/openai-service\">Build custom generative AI solutions</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"what-makes-the-computer-using-agent-unique\">What makes the Computer-Using Agent unique?</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li class=\"wp-block-list-item\"><strong>Autonomous UI navigation</strong>: Can open applications, click buttons, fill out forms, and navigate multi-page workflows.</li>\n\n\n\n<li class=\"wp-block-list-item\"><strong>Dynamic adaptation</strong>: Interprets UI changes and adjusts actions accordingly, reducing reliance on rigid automation scripts.</li>\n\n\n\n<li class=\"wp-block-list-item\"><strong>Cross-application task execution</strong>: Operates across web-based and desktop applications, integrating disparate systems without API dependencies.</li>\n\n\n\n<li class=\"wp-block-list-item\"><strong>Natural language command interface</strong>: Users can describe a task in plain language, and CUA determines the correct UI interactions to execute.</li>\n</ul>\n\n\n\n<p class=\"wp-block-paragraph\">With today’s announcement, developers can start building additional agentic capabilities right away with CUA.&nbsp;As enterprises look to deploy this technology at scale, we are evaluating integration with <a href=\"http://www.windows365.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Windows 365</a> and <a href=\"https://azure.microsoft.com/en-us/products/virtual-desktop\">Azure Virtual Desktop</a> to enable CUA automation to run seamlessly in a managed host environment on Cloud PCs or virtual machines (VMs), ensuring consistent performance while maintaining enterprise compliance and security standards.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-8 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/products/virtual-desktop\">Secured desktops and apps with maximum control</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"ensuring-secure-and-trustworthy-ai-automation\">Ensuring secure and trustworthy AI automation</h2>\n\n\n\n<p class=\"wp-block-paragraph\">As AI systems become more autonomous, ensuring security, reliability, and alignment with human intent is critical. The CUA model is one of the first agentic AI models capable of directly interacting with software environments, bringing new challenges in misuse prevention, unintended actions, and adversarial risks. To address these, Microsoft and OpenAI have implemented a multi-layered safety approach spanning the model, system, and deployment levels.</p>\n\n\n\n<p class=\"wp-block-paragraph\">The CUA model is developed with safeguards to refuse harmful tasks, reject unauthorized actions, and prevent misuse. At the system level, Microsoft implements enterprise-grade content filtering and execution monitoring to help detect and prevent policy violations. To minimize unintended actions, CUA is designed to request user confirmations before executing irreversible tasks and to restrict high-risk actions such as financial transactions.&nbsp;</p>\n\n\n\n<p class=\"wp-block-paragraph\">Microsoft’s <a href=\"https://blogs.microsoft.com/blog/2024/09/24/microsoft-trustworthy-ai-unlocking-human-potential-starts-with-trust/\" rel=\"noreferrer noopener\" target=\"_blank\">Trustworthy AI</a> framework further ensures real-time observability, logging, and compliance auditing for enterprise deployments. Automated and human-in-the-loop detection systems monitor execution patterns, identifying anomalous behaviors and enforcing governance policies. These safeguards are continuously refined based on internal red-teaming, external audits, and real-world testing to strengthen protection against prompt injections, adversarial manipulations, and unauthorized access. Given the current reliability level of the CUA model—particularly in non-browser environments—human oversight remains strongly recommended for sensitive operations.</p>\n\n\n\n<p class=\"wp-block-paragraph\">As AI agents evolve, Microsoft is committed to transparency, security, and ongoing risk mitigation. By combining CUA’s built-in safeguards with Azure’s enterprise compliance and governance tools, organizations can deploy AI-powered automation with confidence, ensuring safe and responsible AI adoption at scale.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-9 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://azure.microsoft.com/en-us/solutions/ai\">Build and scale exceptional generative AI systems</a></div>\n</div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"getting-started-with-cua-and-responses-api\">Getting started with CUA and Responses API</h2>\n\n\n\n<p class=\"wp-block-paragraph\">Azure AI Foundry continues to push the boundaries of AI-powered automation. Enterprise customers will gain access to the Responses API and CUA in <a href=\"https://azure.microsoft.com/en-us/products/ai-services/openai-service/\">Azure OpenAI Service</a> in the coming weeks.</p>\n\n\n\n<p class=\"wp-block-paragraph\">We’re excited to see how developers and businesses innovate with these new capabilities.&nbsp;&nbsp;</p>\n\n\n\n<aside class=\"cta-block cta-block--align-left cta-block--has-image wp-block-msx-cta\">\n\t<div class=\"cta-block__content\">\n\t\t\t\t\t<div class=\"cta-block__image-container\">\n\t\t\t\t<img alt=\"bCLO20b_Sylvie_office_night_001\" class=\"cta-block__image\" height=\"683\" src=\"https://azure.microsoft.com/en-us/blog/wp-content/uploads/2024/07/bCLO20b_Sylvie_office_night_001-1024x683.jpg\" width=\"1024\" />\t\t\t</div>\n\t\t\n\t\t<div class=\"cta-block__body\">\n\t\t\t<h2 class=\"cta-block__headline\">Azure AI Foundry</h2>\n\t\t\t<p class=\"cta-block__text\">Innovate the future of AI using prebuilt and customizable elements.</p>\n\t\t\t\t\t\t\t<div class=\"cta-block__actions\">\n\t\t\t\t\t<a class=\"btn cta-block__link btn-link\" href=\"https://azure.microsoft.com/en-us/products/ai-foundry\">\n\t\t\t\t\t\tGet started &gt;\t\t\t\t\t</a>\n\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t</div>\n</aside>\n\n\n\n<p class=\"wp-block-paragraph\"><a id=\"_msocom_15\"></a></p>\n<p>The post <a href=\"https://azure.microsoft.com/en-us/blog/announcing-the-responses-api-and-computer-using-agent-in-azure-ai-foundry/\">Announcing the Responses API and Computer-Using Agent in Azure AI Foundry</a> appeared first on <a href=\"https://azure.microsoft.com/en-us/blog\">Microsoft Azure Blog</a>.</p>",
    "url": "https://azure.microsoft.com/en-us/blog/announcing-the-responses-api-and-computer-using-agent-in-azure-ai-foundry/",
    "published_date": "Tue, 11 Mar 2025 20:30:00 +0000",
    "processed": false
  }
]